package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class AprilActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_april);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "В квітні температура повітря йде в гору, в цей період можна проводити аерацію, проколювання, вичісування газону.  Також, можна підсіяти, залатати пошкоджені місця, провести внесення весняних комплексних добрив з великим вмістом азоту  для активного росту! В цей місяць потрібно боротись із грибковими захворюваннями, для цього краще обробити газон баковою сумішшю з декількох фунгіцидів, і можна обробити газон залізним купоросом від моху.",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "В квітні багато роботи по догляду за квітами. Потрібно прибрати укриття з троянд, провести обрізку, видалити оцвітину, відмерші рештки, здійснити обробку від хвороб препаратом\"Хорус\" та від шкідників таких як \"Оленка волохата\" препаратом \"Енжіо\". Можна внести азотні добрива для кращого росту та вегетації квітів. В цей період можна проводити пересадки та створення нових клумб, міксбордерів, плям на газонах з квітів.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В цей період для початку розкривають рослини. В квітні проводиться обробка рослин по зеленому конусу, коли бруньки набубнявіли і ледь по зеленіли використовують такі препарати: \"30\",\"скор\", \"хорус\", \"енжіо\",\" бордоська суміш\". Продовжуємо пересадку, обкопування, приберання листя., вносимо азотні добрива.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","В квітні зазвичай багато робіт в саду. Потрібно обкопати пристовбурні кола для того щоб знищити шкідників які живуть в грунті і щоб вони не повзли по стовбору. Зняти укриття з рослин.  В квітні проводиться обробка рослин. Можна проводити пересадку рослин.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "В цьому місяці можна висаджувати картоплю. Розсаду томатів можна почати залишати на балконі на всю ніч. Якщо температура повітря знизиться до позначки нижче нуля, розсадні ящики слід прикрити плівкою або текстильним полотном. Перші дні такого звикання бережіть молоді рослини від сонця. У перший тиждень місяця вже закінчують посів скоростиглих сортів томатів. Для початку варто потурбуватися підготовкою грунту, в який ви будете висаджувати розсаду овочів. Щоб зберегти максимальну кількість вологи, прорихліть землю на грядках. В перші дні місяця у відкритий грунт висівають такі холодостійкі культури як: редис, морква, редька, цибуля, салат, горох та інші. Так як на вулиці ще досить холодно, на ніч посадки необхідно вкривати плівкою або нетканим матеріалом. Уже можна посадити і багато зелені, наприклад: шпинат, петрушка, кінза, кріп та інші. В теплиці можна висівати капусту, броколі, пряні трави.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "Всі кімнатні квіти потрібно пересаджувати хоча б раз на рік. Це необхідно для формування правильної кореневої системи або повної заміни ґрунту. Згодом земля ущільнюється, і коріння рослини стає набагато важче здобувати необхідні поживні речовини. Для росту листя необхідний азот, але головне - не перегодувати, бо спочатку це викличе бурхливе зростання, але в підсумку вийдуть ніжні слабкі листя і витягнуті стебла. Калій сприяє визріванню стебел і насиченою забарвленням квіток. Фосфор необхідний для пишного тривалого цвітіння. Але надлишок цих елементів призводить до прискореного визріванню рослин і мізерного цвітіння. Тому завжди краще недогодувати, ніж перегодувати. Якщо прийнято рішення розмножити рослину, то кращим способом вважається поділ на стеблові або листові черешки. Для утворення коренів живці поміщають в відстояну воду, куди попередньо доданий торф (1: 1). При появі коренів, квітка садять в горщик. У квітні висаджують насіння домашніх квітів, орієнтуючись на вигляд і особливості культури.\n" +
                "Місяць актуальний для вигонки цибулинних рослин. Після закінчення їх цвітіння їх підгодовують і поливають до жовтого листя.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}