package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class AugustActivity3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_august3);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "Серпень радикально не відрізняється від липня в догляді за газоном. В цьому місяці можна провести аерацію. Якщо Вам починають заважати кроти то з ними потрібно поборотись препаратом \"Фостоксин\", або \"Джин\". В цей період можна запіскувати газон  розсипавши по ньому рівномірний шар піску. Якщо заважають мурахи можете перемішати з цукром препарат \"актара\" і розкидати по газону.",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "В серпні можна пересаджувати такі рослини як: астільба, дельфініум, децентра, флокс, іриси, бадан, піон та інші. Потрібно удобрити фосфорними і калійними добривами квіти які будуть квітувати восени: астри, гладіолуси, георгіни, троянди, рудбекію та інші.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В серпні чагарники потребують зволоження. Лохину потрібно підсипати кислим торфом та полити кислотою. Проводиться боротьба з бур'янами. В цей період відбувається збір врожаю. Окуліровка брунькою.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","У цьому місяці, так само як і в попередньому, на плодовій ділянці рихлите грунт в пристовбурних кругах, прополювати бур'яни, поливайте новосадки.\n" +
                "Серпень в саду - час збору врожаю і підгодівлі. Не пропустіть 19 серпня Яблучний спас - свято освячення плодів, якими прийнято всіх пригощати. А на Горіховий - 29 серпня - влаштуйте проводи літа і дружне закриття літнього сезону.\n" +
                "Не допускайте розростання бур'яну, так як при прополюванні разом з нею вириваються і вкорінені зелені живці.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "В серпні розпочинаємо викопку картоплі та просушуємо її в тіні.  Поливаємо. Але не перезволожуємо грядки. Час готувати погріб, або пристосувати місце для зберігання врожаю. Насамперед на грядках завершують третю проривку (проріджування) буряка, прибираючи пучкову продукцію – коренеплоди діаметром 3–4 см, залишаючи рослини на відстані 6–8 см один від одного. Вибірково прибирають петрушку і селеру, використовуючи їх для сушіння, соління, заморожування, консервування. Вибірково прибирають моркву. В цей час садівники закінчують посіви ранніх дайкон, повторно висівають редис, крес–салат, ріпу, салати, цибулю на зелень, шпинат і іншу зелень. Видаляють нижні 4–5 листків у кореневої петрушки для її кращого дозрівання.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "У серпні більшість домашніх квітів все ще добре ростуть і цвітуть. Тому в цей час вони як і раніше мають потребу в гарному догляді: частому поливі і своєчасних підгодівлі. Якщо рослини знаходяться на балконі, в похмурі дні їх не варто поливати. Кактуси і сукуленти в серпні повинні отримувати достатню кількість світла, тому їх краще за все тримати на підвіконні. Поливати ці рослини слід помірно, а ось підгодовувати не варто. Сильно розростані за літо рослини (фікуси, гібіскуси, диффенбахії) можна пересадити в більш об`ємні ємності.\n" +
                "Решта рослини будуть раді оновленню грунту. Їх не обов'язково пересаджувати, досить тільки зняти кілька сантиметрів верхнього шару ґрунту і підсипати свіжого субстрату. У гіппеаструмів і кал в серпні починають жовтіти листя - це значить, що квіти готуються до періоду спокою. Кали в цей час слід періодично зволожувати, але тримати на колишньому місці. Якщо кали і гіппеаструми йдуть на спокій, то цикламени, навпаки, починають активно рости. Саме час їх пересадити. Для цього можна взяти невеликі горщики, в які насипати грунтосуміш з листової землі, перегною, торфу і піску (3: 1: 1: 1).",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}