package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class DecemberActivity3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_december3);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "В грудні можна встановити щит для захисту газону від снігових заносів, можна накрити його агроволокном, якщо на ньому утворитися кірка то розбийте її граблями. Якщо буде тепло і з\\'являться кроти то з ними потрібно поборотись препаратом \"Фостоксин\", або \"Джин\". Виключіть будь-які навантаження - не ходите по газону до утворення стійкого снігового покриву. Не порушуйте сніговий покрив, що формується, на Вашій ділянці. Ходити на лижах, грати дітям, гуляти з домашніми тваринами краще при висоті снігу на газоні 20-25 см. У деяких регіонах взимку випадає мокрий сніг або дощ, після яких сніговий покрив ділянки покривається крижаною кіркою, що перешкоджає проникненню кисню повітря до дихаючих рослин і сприяючи накопиченню вуглекислого газу в шарі снігу під кіркою, - це призводить до задушення рослин. Руйнуйте крижану кірку за допомогою звичайних грабель і інших інструментів. Особлива увага цього місяця, та і взагалі взимку, приділите підготовці техніки - проведіть очищення усіх інструментів і змастить мастилом деталі, що труться. Згідно інструкції з експлуатації проведіть технічне обслуговування косарок з двигуном. При виникненні труднощів звертайтеся до фахівців в сервісний центр. ",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "В грудні потрібно перевірити чи добре тримається укриття рослин. Якщо випаде сніг то його можна зібрати з доріжок і притрусити ним квітники для утеплення. Також у цей час можна зайнятись вигонкою цибулевих рослин. Посадкою в грунт, цибулини тюльпанів слід на місяць помістити в приміщення з температурою + 5 С °, і вологістю 85 – 90 %, можна використовувати нижню полицю холодильника. Для посадки можна використовувати звичайні пластмасові ящики, засипаємо в ящики річковий пісок або торф товщиною близько 3 см, акуратно висаджуємо цибулини на відстані близько 10 – 20 мм одна від одної, трохи поглиблюючи їх. Поливаємо і засипаємо другим шаром піску, так щоб пісок, покрив повністю цибулини, при цьому кінці верхівок повинні трохи стирчати. Ще раз поливаємо, але вже з додаванням розчину кальцієвої селітри в співвідношенні 2 грами селітри на один літр води. Ящики ставимо в льох для вкорінення цибулин, в цей період освітлення не потрібне, тільки знижена температура близько 5 С° і вологість 85%. У міру висихання грунту, його слід злегка періодично зволожувати, тут головне не перестаратися, щоб цибулини не почали гнити. ",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "Сніг в саду - чудовий матеріал для теплоізоляції. Чим його більше, тим краще зносять зиму рослини, в т.ч. озимі посіви, плодові сади, ягідні чагарники і квіти, оскільки він захищає ґрунт від глибокого промерзання. Виходячи з цього, основне завдання для грудня - затримати сніг. При нестачі снігу дерева і чагарники можуть постраждати, тому важливо укрити снігом нижню частину стовбурів дерев до висоти 50-60 см і радіусом пристовбурного кола 1-1,5 м. Але є рослини, які не люблять товстий сніговий покрив - це чорноплідна горобина, вишня, слива. А ось яблуні витримують покрив товщиною до 1,3 м. У смородини і аґрусу плодові бруньки не стійкі до морозу, тому їх краще вкрити снігом повністю. Малина також прекрасно зносить високі кучугури понад 1,2 м. Необхідно пам'ятати, що мокрий сніг небезпечний для саду: під його вагою гілки дерев можуть не витримати і зламатися, особливо ті, яким було зроблено щеплення. Тому мокрий сніг треба струшувати з гілок і розбивати грудки всередині крон. Скидати сніг треба у міру його накопичення. Ще одне з найважливіших завдань для садівника в грудні -захист саду від гризунів і зайців. Для цього слід щільно обв'язати штамби і скелетні гілки дерев з підручних матеріалів (гілки малини або ожини, ялиновий лапник, руберойд, дрібна сітка, яка повинна бути поглиблена в землю). Або ж обробити стовбури спеціальною відлякуючою сумішшю. Для захисту від мишей потрібно ущільнювати сніг навколо дерев - рити нори для них стане важко.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","Важливим завданням садівника в грудні є роботи в саду по захисту від гризунів - мишей і зайців. Якщо існує ймовірність нашестя гризунів, молоді дерева слід обв'язати спеціальною сіткою або іншими матеріалами. Для захисту від мишей корисно ущільнювати сніг навколо дерев.\n" +
                "Якщо на плодових деревах залишилися муміфіковані плоди, їх необхідно зняти з гілок і знищити. Якщо цього не зробити, можна піддати дерево грибковому захворюванню, або навалі шкідників, що знаходяться всередині плоду.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "У грудні роботи в городі обмежуються приведенням в порядок і ремонтом парників і іншого садового обладнання. Грудень - саме час приступити до заготівлі ємностей для розсади - упаковок від молока, сметани та інших відповідних коробочок, або купити готові палети. Почавши збирати їх зараз, навесні у вас не буде головного болю про те, у що садити розсаду.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "У грудні багато кімнатних рослин перебувають у стані спокою. Однак є рослини, які цвітуть і в цей час. Так, зацвітає Зигокактус притуплений - «гість» зі східної частини Бразилії. У цей період йому необхідні поливання, обприскування і підгодівля у вигляді слабких розчинів коров'яку. З'являються бутони у ріпсаліс Хоуллета, а також у епіфіллюму незграбного.\n" +
                "Пеларгонії, фуксії і олеандри ставлять в самому прохолодному місці кімнати і поливають дуже помірно, щоб не викликати передчасне зростання.\n" +
                "\n" +
                "Цикламени розміщують на східних або південних вікнах при температурі + 15-18 ° С, поливають з піддону відстояною водою кімнатної температури.\n" +
                "\n" +
                "Відцвітають сенполії, їх ставлять в прохолодне світле місце, земляну грудку зволожують помірно, поверхню його періодично розпушують. Щоб продовжити цвітіння, ці рослини досвічують по 12-14 годин на день.\n" +
                "\n" +
                "Фікуси в грудні поливають помірно - від зайвої вологості грунту нижнє листя опадає і рослини втрачають декоративний вигляд. Філодендрони, монстери і сциндапсуси, що не припиняють зростання, регулярно поливають і підгодовують слабким (0,1 0,2% -ним) розчином мінеральних добрив.\n" +
                "Папороті розташовують на добре освітленому місці, щодня обприскують, систематично зволожують грунт в горщиках, не допускаючи пересушування, інакше рослини можуть загинути.\n" +
                "Орхідеї, щоб розвивалися квітконоси регулярно поливають і містять в світлому прохолодному місці.\n" +
                "Азалії в період утворення бутонів розміщують в теплій кімнаті (+ 18-23 С°), рівномірно поливають і щодня обприскують.\n" +
                "Щоб камелії не скинули бутони і зацвіли, їх містять в прохолодному приміщенні (+ 12-15 С°) поливати та оприскувати.",R.drawable.plants));
        mlist.add(new MonthDetailModel("Декоративні водойми", "На зиму осушують тільки маленькі, дрібні водойми із пластику. Водойми, виконані з плівки ПВХ і облицьовані природним каменем, необхідно тримати наповненими: взимку навколишній грунт промерзає, виникають спучування грунту, а тиск замерзлої води в ставку компенсує цю розпираючу силу. У  водоймі чимало органіки, залишків водних рослин, розкладаючись, вони «з'їдають» кисень. Риба під льодом, на який зверху ще й снігу навалило, запросто може задихнутися. Як цього уникнути: - Зробити у льоду ополонку і підтримувати її в незамерзаючому стані.", R.drawable.vodoimu));
        mlist.add(new MonthDetailModel("Садові лайфхаки", "Половинки цитрусових можна використовувати в якості горщиків для розсади. Зробіть отвір в нижній частині шкірки для дренажу, заповнити грунтом, посійте насіння. Принадність такого «горщика» в тому, що розсаду висаджують прямо в шкірці. Шкірка буде розкладатися в грунті і живити молоду рослину. Вирощування розсади в яєчній шкаралупі - ну чим не лайфхак? Мало того, що ви заощадите на горщиках, так ще і рослини будуть отримувати достатню кількість кальцію! Висаджуючи розсаду,  шкарлупу не викидайте, а розкришіть в грунт - це дуже корисно.Ще одна корисна порада: вирощувати розсаду можна в картонних коробках для яєць. Це просто і зовсім не затратно. На дні можна зробити отвір для кращого дренажу.", R.drawable.lifehack));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}