package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class DecemberActivity3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_december3);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "В грудні можна встановити щит для захисту газону від снігових заносів, якщо на ньому утворитися кірка то розбийте її граблями. Якщо буде тепло і з'являться кроти то з ними потрібно поборотись препаратом \"Фостоксин\", або \"Джин\".",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "В грудні потрібно перевірити чи тобре тримається укриття рослин. Якщо випаде сніг то його можна зібрати з доріжок і притрусити ним квітники для утеплення. Також у цей час можна зайнятись вигонкою цибулевих рослин, висаджувати їх у вологий пісок щоб на день закоханих можна було падарувати свіжі квіти!",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В зимку потрібно струшувати сніг з гілок, перевірити чи тримається укриття.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","Важливим завданням садівника в грудні є роботи в саду по захисту від гризунів - мишей і зайців. Якщо існує ймовірність нашестя гризунів, молоді дерева слід обв'язати спеціальною сіткою або іншими матеріалами. Для захисту від мишей корисно ущільнювати сніг навколо дерев.\n" +
                "Якщо на плодових деревах залишилися муміфіковані плоди, їх необхідно зняти з гілок і знищити. Якщо цього не зробити, можна піддати дерево грибкового захворювання, або навалі шкідників, що знаходяться всередині плоду.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "У грудні роботи в городі обмежуються приведенням в порядок і ремонтом парників і іншого садового обладнання. Грудень - саме час приступити до заготівлі ємностей для розсади - упаковок від молока, сметани та інших відповідних коробочок, або купити готові палети. Почавши збирати їх зараз, навесні у вас не буде головного болю про те, у що садити розсаду.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "У грудні багато кімнатних рослин перебувають у стані спокою. Однак є рослини, які цвітуть і в цей час. Так, зацвітає Зигокактус притуплений - «гість» зі східної частини Бразилії. У цей період йому необхідні поливання, обприскування і підгодівля у вигляді слабких розчинів коров'яку. З'являються бутони у ріпсаліс Хоуллета, а також у епіфіллюм незграбного.\n" +
                "Пеларгонії, фуксії і олеандри містять в самому прохолодному місці кімнати і поливають дуже помірно, щоб не викликати передчасне зростання.\n" +
                "\n" +
                "Цикламени містять на східних або південних вікнах при температурі + 15-18 ° С, поливають з піддону відстояною водою кімнатної температури.\n" +
                "\n" +
                "Відцвітають сенполії, їх ставлять в прохолодне світле місце, земляну грудку зволожують помірно, поверхню його періодично розпушують. Щоб продовжити цвітіння, ці рослини досвічують по 12-14 годин на день.\n" +
                "\n" +
                "Фікуси в грудні поливають помірно - від зайвої вологості грунту нижнє листя опадає і рослини втрачають декоративний вигляд.Філодендрони, монстери і сциндапсуси, що не припиняють зростання, регулярно поливають і підгодовують слабким (0,1 0,2% -ним) розчином мінеральних добрив.\n" +
                "Папороті розташовують на добре освітленому місці, щодня обприскують, систематично зволожують грунт в горщиках, не допускаючи пересушування, інакше рослини можуть загинути.\n" +
                "Орхідеї , щоб розвивалися квітконоси, регулярно поливають і містять в світлому прохолодному місці.\n" +
                "Азалії в період утворення бутонів розміщують в теплій кімнаті (+ 18-23 ° С), рівномірно поливають і щодня обприскують.\n" +
                "Щоб камелії не скинув бутони і зацвіли, їх містять в прохолодному приміщенні (+ 12-15 ° С) поливати та оприскувати.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}