package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class FebruaryActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_february);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "У лютому догляд за газоном сильно не відрізняється від січня. В цьому місяці можна розпочати налаштовувавти садову техніку та механізми: замінити мастило в газонці та аераторі, наточити ножі, поремотувати зламаний інструмент, адже весною часу на це буде мало!",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "У лютому настав час висадити  рослини, які добре почуваються і в саду, і в домашніх умовах – фуксії, бальзаміни, пеларгонії, і рослини раннього терміну цвітіння для підвісних кашпо, петунію і лобелію, наприклад. У лютому сіють насіння лаванди вузьколистої, сальвії блискучої, геліотропа.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "Якщо у лютому сильні морози рослини потрібно додатково вкрити, ущільнити сніг навколо стовбура, вкрити рослини соломою, або агроволокном. В кінці лютого може з'явитися яскраве сонце і в сумі з відбиваючою поверхнею снігу може дати опіки хвойним деревам тому, хвойні чагарники потрібно вкрити агроволокном щоб запобігти сонячним опікам. Також, в цей період можна розпочинати обрізку плодових рослин, смородина, ожина, лохина, агрус та інші.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","В лютому можна вкрити рослини від сонячних опіків. Якщо піде сніг обтрусити його з гілок. Можна розпочинати обрізку дерев при температурі не нижче -5 С°.  В  садах потрібно відганняти напади зайців розкидуючи відлякуючі речовини.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "Сійте насіння овочевих культур, вибравши вподобані вам або нові сорти, які ви плануєте вирощувати. Придбайте касети, горщики, адсорбуючі таблетки, грунтосуміші для розсади, добрива, агроволокно і плівку або перевірити наявність і стан. Вибираючи розсадну суміш, пам'ятайте, що найкращою, але і найдорожчою вважається суміш торфу з добавкою перліту. Для економії можете заготовити чорнозем, в який додайте 50% магазинної суміші.\n" +
                "Для захисту від першої хвороби розсади - чорної ніжки - придбайте «Тріходермін» або «Превікур». насіння перед посівом обробіть фунгіцидом: СелестТоп, Максим, Превікур Енерджі. І не забудьте про добрива - як під конкретну культуру, так і універсальних, мінеральних або органічних, однокомпонентних або комплексних.Купіть сіянку цибулі для весняної посадки.\n" +
                "Визначтеся з місцем посіву перших культур - гороху, моркви, цибулі, петрушки, кропу, редиски. Зараз можна відкидати сніг з місця майбутньої ділянки, щоб земля тут швидше відтанула.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "Лютий завершує низку важких для кімнатних рослин місяців. Світловий день починає збільшуватися, і рослини виходять зі стану зимового спокою. В кінці лютого їх можна почати підгодовувати, пересаджувати і обрізати.Уважного ставлення до поливу вимагають всі кімнатні рослини. У горщиках, що стоять на підвіконнях, грунт сохне повільніше, ніж зазвичай. Крім того, виникає ймовірність переохолодження земляного кома. Все це може спричинити за собою деякі проблеми, особливо з бульбовими рослинами.                                                               Всі роботи в лютому:Вигонка цибулинних рослин;\n" +
                "Досвічування, зволоження повітря, профілактика від хвороб і шкідників (білокрилки, щитівки, павутинний кліщ);\n" +
                "Підживлення квітучих кімнатних рослин (цикламени, сенполії, зигокактуси, каланхое);\n" +
                "Догляд за орхідеями (фаленопсіси, Ванди);\n" +
                "Догляд за листям рослин (теплий душ, очищення від пилу);\n" +
                "Посів насіння кімнатних рослин (шеффлера, адениума, пасифлори, цикламен);\n" +
                "Підживлення вічнозелених кімнатних рослин;\n" +
                "Полив кімнатних рослин, що знаходяться в стані спокою (фуксії, пеларгонії), мінімальний;\n" +
                "Посадка бульб глоксиній та ахіменес при проростанні бруньок;\n" +
                "Живцювання листом (заміокулькас, сансевієрія, стрептокарпус)\n" +
                "обрізка пеларгоний.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}