package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class JenuaryActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_jenuary);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "При прибиранні снігу в зимку, слідкуйте щоб він не лежав на газоні на одній купі, а був розподілений рівномірно. В січні потрібно подбати щоб по газону ніхто не ходив, для того аби він мав гарний вигляд весною, а також ящо на газоні буде кірка з льоду то її потрібно розбити граблями для кращого доступу повітря. Якщо на газоні з'являться кроти то з ними потрібно поборотись препаратом \"Фостоксин\", або \"Джин\".",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "Якщо Ви хочете мати гарну клумбу влітку, то в січні потрібно розпочинати висівати насіння таких рослин як: гвоздика Шабо, лобелія, петунія, цинерарія, ротики, чина запашна, цинія, чорнобривці, настурція, космея, календула, резеда, герань, гербера, гайлардія, віола, братки, примула, бальзамін, бегонія, вербена, агератум, айстра, кларкія, флокси, левкой, сальвія, годеція, люпин, лаватера і багато інших.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В січні при догляді за чагарниками потрібно оглянути цупкість укриття цих рослин, або навпаки струсити сніг якщо його забагато в іншому випадку він виломує гілля. Якщо на вулиці не має сильних морозів д -5 С° можна проводити стрижку, або обрізку рослин.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","Пухкий і мокрий сніг особливо небезпечний  для тих зимових сортів яблуні, які ще мають не повністю скинутий лист. У такому ж становищі іноді знаходяться і молоді посадки, які протягом літньо-осіннього періоду часто поливали і рясно удобрювали азотом. У таких рослин, подовжений період росту, на кінцях однорічних пагонів багато листя.  Взимку гілки дерев дуже тендітні, тому в дні відлиг треба обережно струсити снігову шапку з крони дерева.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "Зимові місяці для дачників більш спокійні. І коли як не взимку потрібно зайнятися пошуком дачних новинок, поділитися своїм досвідом і скористатися порадами інших досвідчених дачників",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "Квітучі взимку сенполії, цикламени, азалії, зигокактуси, примули, кали виставляють при 16–18 С ближче до світла або досвічують ультрафіолетовими лампами, поміщаючи їх на відстані 10–15 см від верхівки рослин. Тривалість досвічування 12–14 годин на добу.Холодолюбиві культури – олеандр, аукубу, самшит, лавр, кипарис, криптомерії, рускусу і ін. – виставляють в світлих прохолодних приміщеннях, поливають дуже рідко, коли підсохне земляний кому.Куплені в магазині цинерарія та кальцеолярії встановлюють в світлому прохолодному місці (12–16 С) і щодня поливають. Болотні рослини - циперуси і ін. - не повинні знаходитися в цей час в надмірно зволоженому грунті, їм дуже корисна просушка земляної грудки для доступу повітря до коріння. Також слід стежити за станом всіх рослин горщиків, підтримувати їх в чистоті, періодично рихлити поверхневий шар землі.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}