package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class JulyActivity3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_july3);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "В липні догляд суттєво не відрізняється від червня, активний полив, але дивіться щоб не було перезволоження, можна внести ще азотних добрив якщо ваша трава слабко росте! Стрижка на рівні 6–7 см для захисту від спеки молодих паростків.",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "Липень це період коли можуть з'явитись грибкові захворювання тому рослини можна обробити системним фунгіцидом \"Скор\".В цей час потрібно зайнятись активно боротьбою з бур'янами. Якщо побачите тлю на трояндах то потрібно використати інсектициди загальної дії такі як \"актара\". Це період коли можна висівати у відкритий грунт дворічники:наперстянка, мальва, маргаритки, фіалки, гвоздика турецька.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В липні так як і вчерні потрібен полив, бротьба із бур'янами та рихлення грунту. Якщо з'явиться попелицято рослини потрібно обробити препаратом \"актофіт\". Також можна підстригти ще не доглянуті кущі та внести азотні добрива. Потрібно підв'язати рослини які розрослись. Обрізання відцвівших квітів.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","В міжряддя саду в першій половині липня можна посіяти сидерати (гірчицю, фацелію, горох, вику) для збагачення грунту органічними речовинами. Вони особливо корисні на перезволожених ділянках, так як підсушують їх і припиняють зростання дерев, що сприяє кращій підготовці їх до зими.У цьому місяці, так само як і в попередньому, на плодовому ділянці рихлите грунт в пристовбурних кругах, прополювати бур'яни, поливайте новосадкі.\nПротягом літа збирайте і спалюйте опале з зелених живців листя (щоб знищити інфекцію грибних захворювань).\nНе допускайте розростання бур'яну.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "Поверхневе розпушування рекомендується проводити після кожного дощу або поливу. Ця нескладна операція допомагає зберегти вологу, поліпшити повітрообмін, перешкоджає утворенню кірки на поверхні грунту, сприяє знищенню сходів бур'янів. Продовжуємо розпочаті в червні роботи по формуванню рослин томата, перцю, огірка і не забуваємо про полив рослин. У липні приходить час пожинати плоди своєї праці. У міру збирання врожаю на городі звільняються грядки, які засівають сидератами або скоростиглими овочевими, зеленими культурами. У липні можна сіяти повторно редис, ріпу, петрушку, салати.У липні для багатьох городників стають особливо актуальними питання боротьби з фітофторозом томатів і картоплі, та колорадським жуком препаратом Актофіт, Ридоміл Голд, Квадріс, Ревус.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "Поливати рослини в липні слід чистою дощовою водою або відстояною водопровідної (можна кип'яченою). Рослини, розміщені в балконних ящиках, можна поливати звичайною проточною водою без кип'ятіння. Частоту поливу підбирають в залежності від потреб рослин. В середньому, в жарку пору зволожувати грунт в квіткових горщиках слід щодня вранці і ввечері. Квіти, що знаходяться влітку в стані спокою (цикламени, кали, гіппеаструми.У кімнатних квітниках часто зустрічаються молоді рослини, вирощені з насіння або живців. До літа їм, як правило, стає тісно в ємностях, в яких вони жили з весни: коріння освоюють весь земляний кому і навіть переглядають через дренажні отвори. Таким рослинам потрібна пересадка, яку проводять методом перевалки. Для перевалки не слід підбирати дуже великі горщики. Нове \"житло\" має бути більше попереднього на 2-3 см.Якщо завелися шкідники …\n" +
                "При появі на листках рослин плям, слід перевірити, чи не пошкоджена рослина шкідниками. Про наявність комах може свідчити і пожовтіння листя. Такі екземпляри слід ізолювати від інших рослин. Якщо на них дійсно з'явилися шкідники, позбутися від них можна наступним чином: змити водою і обробити настоєм тютюну з господарським милом, або препаратом \"актофіт\".",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}