package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class JuneActivity3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_june3);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "В червні потрібно відрегулювати систему поливу адже в жаркий період газон потребує більше вологи, полив має відбуватись не менше двох разів на ніч з розрахунку 4–7л на м²,якщо нема дощів. Траву потрібно стригти не нижче 4–5 см. І розпочинається період боротьби з бур'янами, це можна зробити як гербіцидами вибіркової дії такими як \"Гольф\", \"Діален\", \"Дікамба\" та інші, або механічним шляхом прополюючи руками.",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "В червні стає доволі спекотно, тому потрібно не забувати про полив. Можна внести комплексні мінеральні та органічні добрива для багаторічних квітів, наприклад:  можна змішати  перегній з попелом, мінеральними добривами та водою в співвідношені 4:1:1:5 частин, після бродіння на протязі трьох тижнів розбавляти з в вдою в співіддношенні 1 літр розчину  на 5 літрів води.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В червні у з'язку з підняттям літніх температур потрібно активно поливати рослини, прополювати бур'яни та рихлити грунт. Підвязування та підрізання(десекація) ожини, малини, лохини. Підстригання шпилькових  чагарників та дерев: сосна, ялина, ялівець, туя. Також, можна підстригти весняноквітучі чагарники: дейції, деякі спіреї, тощо.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","Дерева в червні потрібно гарно поливати, адже збільшується температура повітра і грунт навколо дерев повинен бути гарно зволожений. В цей період потрібно активно стригти туї, кипарисовики, ялівці, ялину, сосну та інші.Основні роботи які потрібно виконати в цей період:\n1. Обприскування рослин відповідними хімічними засобами.\n2. Знищення бур'янів під культурами і між ними.\n3. Регулярне стрижку трави, де може оселитися шкідник.\n4. Обрізку дерев.\n5. Регулярний огляд плодових культур.\nТак як тлю на ділянку приносять мурахи - вони також автоматично стають небезпечними комахами, і від них треба позбавлятися. Мурашники знаходять і заливають спеціальним засобом.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "У цьому місяці останній термін для висадки розсади томатів, огірків, гарбуза. Моркву можна сіяти весь місяць, щоб отримати пізній урожай в жовтні.\n" +
                "Висадка розсади різних видів капусти пізніх сортів.\n" +
                "Приділіть увагу прополюванні від бур'янів, в цей час вони активно ростуть. Запорука високого врожаю залежить від регулярного прополювання грядок.\n" +
                "В кінці місяця прийшов час для посадки чорної редьки. Щоб коренеплоди виростали смачними, не забувайте поливати рослини.У червні сіють багаторічні цибулі, щоб мати соковиту зелень в майбутньому сезоні.\n" +
                "Проводять посів насіння квасолі, закладаючи в грунт на невелику глибину.\n" +
                "Сходи огірків прорідити, щоб відстань між рослинами було не менше 15 см. При появі декількох листочків прищипните верхівки рослин - це дасть розвиток бічних відростках.\n" +
                "Вам належить боротися зі шкідниками на городі. У цей час активізуються капустянка, влаштовуйте їй пастки у вигляді закопаних у землю пластмасових бутилок заповнених забродившим вареням чи пивом.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "Найкраща пора в житті кімнатних рослин настає в червні. Молодий приріст вже закрив рани, і здорова листва радує око. Коріння активно освоюють нові земляні \"простори\" і добувають необхідне харчування.Багаторічні рослини, вирощувані в горщиках або діжках, вимагають більшої уваги, ніж їх родичі у відкритому грунті. Щодня перевіряйте, чи не пересохла земля в горщиках. Кращий час для поливу - ранкові або вечірні години. З ранку рослини не завадить ще й обприскати, щоб змити з листя пил.\n" +
                "\n" +
                "Підживлення пересаджених рослин\n" +
                "У червні починають підгодовувати пересаджені навесні рослини (інші повинні отримувати підгодівлі ще з лютого-березня).\n" +
                "Поряд з комплексними мінеральними добривами по черзі можна використовувати і органічні - гнойову рідину (1:10), пташиний послід (1:25), біогумус (по інструкції). Вносять добрива кожні 10-14 днів, попередньо поливши рослини.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}