package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class MarchActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_march);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "У березні потрібно подбати про виведення з газону талої води якщо така є, і не потрібно допускати витоптування газону, адже в цей період від дуже слабкий!",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "В березні ми можемо вирощувати ехінацеї,  тютюн, вербену, іберіс, клеоми, дзвіночків, гвоздики-трав’янки, однорічного флокса, ротиків, матіоли (левкоя), брахікоми іберісолистої й азаріни лазячої, а також тих квітів, які ви з якої-небудь причини не посіяли в лютому. В першу половину березня можна висівати насіння квітів, що добре зростають як у саду,  і в домашніх умовах – пеларгонії, колеусу. У другу половину березня ми сіємо розсаду таких однорічників: флокс Друммонда, целозія, геліхрізум, алісум, венідіум, агератум, арктотіс, однорічна айстра, пенстемон, рицина.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В березні коли температура повітря підніметься вище +10 можна проводити обробку рослин \"бордоською сумішшю\", або препаратом\"хорус\"  від грибкових захворювань. Можна продовжувати обрізку рослин, також хто ще не встиг можуть зробити зачистку та замазування морозобоїн після зими. Можна розпочинати пересадку, зібрати минулорічне листя.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","В березні рзпочинається весняна обрізка дерев, коли температура повітря не опускається нижче -5 можна розпочинати роботу. В цей період можна підбілити стовбури, або зробити ловчий пояс для затрибки шкідників які будуть рухатись по стовбору. Також, можна замазати садовим варом, або гель-лаком морозобоїни. В кінці березня можна проводити прививку рослин копуліровкою.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "Багато садівників в березні влаштовують парники на сонячному обігріві для вирощування розсади, щоб менше возитися з нею на підвіконнях. На сонячному місці робимо дерев'яний короб, у якого північна стіна 15 см вище південній, верх накриваємо склом або затягуємо плівкою. Сіем овочі які збираємося вирощувати в відкритих грядках. Для неопалюваних теплиць починаємо роботу на два тижні раніше. На дно розсадних ємностей насипаємо дренажний шар (1-2 см).\n" +
                "У розсадних ящиках це може бути просто шар піску, а в стаканчиках - керамзит, черепки горщиків, шматочки вугілля. Потім насипаємо грунтову суміш. Щоб вона краще (без пустот) вляглася, струшуємо ємності, а потім ущільнюємо грунт по стінках і кутах ємностей руками.На початку місяця в парник сіють на розсаду ранньостиглу білокачанну і цвітну капусту, в кінці - капусту пізніх сортів. Насіння капусти перед посадкою прогрівають протягом 20 хвилин у воді з температурою 50 ° С, потім опускають на 2-3 хвилини в холодну воду і після цього просушують.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "В березні суккуленти починають поливати тільки на 5–7–й день після пересадки.Березень – дуже важливий місяць для кімнатних рослин, посів і пересадка головні роботи в цьому місяці. Більшість весняних робіт з домашніми квітами проводиться саме в березні, як доглядати за домашніми квітами ранньою весною. Кращий час для пересадки і перевалки багатьох рослин. Молоді і здорові екземпляри пересаджують щорічно в більшу ємність, дорослі і великі через 2–3 роки, беручи до уваги їх стан і розвиток. У разі хворобливого вигляду і пригнобленого зростання, тобто ознак загнивання коренів, квіти пересаджують в горщики меншого розміру з легкої піщаним ґрунтом. Перший час їх ставлять на світлі в теплому місці, поливають дуже помірно і не підживлюють, поки не почнуть відростати нові листя.Зберігаються взимку в прохолодному місці рослини з обпадаючими на зиму листям, такі як фуксії і троянди, переносять в перших числах місяця до світла, пересаджують, підрізають. У гортензій видаляють слабкі пагони, щоб спрямувати всі соки в більш сильні, потім ставлять на сонячне вікно, де вони повільно прокидаються до нового життя і зацвітають. Ці рослини слід обприскувати для запобігання нападу паразитів. З'являються незабаром молоді пагони являють собою прекрасний матеріал для живців. Більш висока температура і мілкодисперсне обррискування, таке як туман, обприскування кактусів теплою водою в сонячні дні, сприятливо позначаються на них. Дуже обережно, в міру необхідності, збільшує вологість грунту, проте лобивии і ехінопсіси поки що тримають в сухому режимі. Кактуси, яким взимку було досить малу кількість світла, дуже чутливі до яскравих променів весняного сонця. Для того щоб вони звикли до зміни, перші дні рекомендується легке притінення кактусів в полуденний час. Кактуси починають поливати не раніше, ніж через 5–7 днів після пересадки, якщо вона необхідна.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}