package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class NovemberActivity3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_november3);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "Листопад не даремно так називають, в цей період потрібно прибрати листя з газону, скосити його на зиму до 3 см, і обробити газон препаратом \"Максім\" від гнилей та грибкових захворювань!",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "В листопаді якщо було сухо потрібно полити квітники на зиму, обробити семивідсодковим розчином сечовини. В цей період укривають троянди, деякі клематиси та гортензії. В цей період викопують із землі на зимове зберігання жоржини, бегонії,иканни їх замотують і вологу тканину і складають на стилажі у сухий погреб.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В листопаді потрібно укрити рослини на зиму, зав'язати кущі щоб рослини не розломало від снігу. Обкопати рослини щоб утеплити кореневу систему у магнолій, троянд, гортензій, рододендронів.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","В листопаді засипте пристовбурні кола дерев шаром торфу товщиною близько 20 см. Розвилки гілочок дерев і штамби, яким менше 10 років, обв'яжіть хвойними гілками і стеблами малини. Кінці обв'язки прикопайте. Підстави чагарників засипте торфом або сухою землею або укладіть ялинові гілки або агро волокно.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "Після передзимового поливу обов'язково потрібно замульчувати грунт пристовбурних кіл шаром компосту, перепрілого гною товщиною 6–8 см. Цей прийом сприяє збереженню вологи і накопичення поживних речовин.  Замульчуйте посадки суниці садової компостом, перепрілим гноєм, торфом шаром 6–8 см. У безсніжні зими коріння цієї культури можуть загинути при опусканні температури грунту до мінус 15 градусів. Мульча допоможе зберегти температуру ґрунту в прийнятному діапазоні. У перші дні листопада, якщо ще стоїть тепла погода і грунт не замерз, можна посадити часник і цибулю-севок. Грядки після посадки даних культур потрібно обов'язково замульчувати перегноєм або торфом шаром 5 см, щоб рослини змогли успішно перезимувати. Заготовити грунт для посівів розсади взимку.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "У листопаді більшість кімнатних рослин повинні бути переведені в стан вимушеного спокою. Повітря в квартирах стає сухим, тому рослини потрібно обприскувати і раз в тиждень обмивати листя під теплим душем. Більшість теплолюбних кімнатних рослин містять в опалювальному світлому приміщенні (+18 … + 22 С). Світлолюбні види (Переськия, епісція, агава американська, алое деревовидне, хлорофітум) розмістіть на підвіконні, якщо немає можливості організувати систему штучного освітлення. Плющ, тетрастигма, адениума краще переносять зиму в прохолодному приміщенні (+10 … + 14 С). В кінці осені садові центри пропонують величезний вибір вже квітучих кімнатних рослин: цикламени, декабристи, азалії, адениума, каланхое. Обов'язково проведіть профілактичну обробку від хвороб і шкідників поставте новобранців в сторонці від своєї колекції. Такий карантин обов'язковий. Іноді рослини можуть бути заражені, але ознаки проявляються не відразу. Полив - в міру висихання верхнього шару грунту. Види тропічного походження (сенполії, стрептокарпуси, фаленопсіси) активно цвітуть. Їх потрібно регулярно поливати, обприскувати теплою водою, досвічувати. Зацвітаючі азалії утримуєте при температурі +18 … + 20 С, поливайте.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}