package com.molfar.gardeningcalendar.month;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.GridLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;

import com.molfar.gardeningcalendar.MonthDetailModel;
import com.molfar.gardeningcalendar.R;
import com.molfar.gardeningcalendar.RecyclerviewAdapter;

import java.util.ArrayList;
import java.util.List;

public class OctoberActivity3 extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_october3);

        List<MonthDetailModel> mlist = new ArrayList<>();
        mlist.add(new MonthDetailModel("Газон", "В цьому місяці потрібно зменшити полив на газоні, а в кінці місяця його можна взагалі вимкнути і злити воду з труб на зиму.",R.drawable.img_lower));
        mlist.add(new MonthDetailModel("Квіти", "Догляд за квітниками в жовтні простіший ніж літом, обрізка відцвівших квітів, пересадка рослин. Це період висадки цибулевих: тюльпани, нарцис і таке інше.",R.drawable.flower));
        mlist.add(new MonthDetailModel("Чагарники", "В жовтні обрізають оцвітину у відцвівших гортензій, троянд, бузку, магнолій. Збір плодів і висівання насіння у відкритий грунт на зиму.",R.drawable.shrub2));
        mlist.add(new MonthDetailModel("Дерева","В жовтні приступаємо до видалення грибів-трутовиків, якщо вони є. Акуратно, за допомогою ножа, знімаємо з стовбура непотрібні нарости. Обов'язково, якщо рана глибока, обробляємо за допомогою мідного купоросу, та замазуемо гель-лаком. Розпочинаємо збір листя.",R.drawable.tree3));
        mlist.add(new MonthDetailModel("Овочеві культури", "У перекопування грунту є як свої плюси (простіше вносити добрива і боротися зі шкідниками), так і мінуси (порушення структури грунту). Остаточне рішення приймається виходячи з поточного стану грунту. На ділянках з важким, глинистих і неокультуреної грунтом від осіннього перекопування все ж краще не відмовлятися. Підготуйте до зимівлі теплицю. Часто саме ця споруда стає розсадником різних хвороб, тому дуже важливо провести її \"консервацію на зиму\" правильно. Промийте і продезінфікуйте каркас і стіни, замініть або обеззаразьте грунт, промийте і просушіть поливну систему, не забудьте внести добрива (30–40 г суперфосфату і 20–25 г калійної солі або сірчанокислого калію на 1 кв.м грунту). Проведіть підзимній посів. В процесі перекопування городу обов'язково не забудьте заздалегідь підготувати грядки для підзимового посіву культур. У жовтні висаджують озиму цибулю і часник, а також висівають петрушку, кріп, буряк, морква, щавель і пастернак. Підзимовий посів робить рослини більш стійкими до несприятливих погодних умов.",R.drawable.vegetables));
        mlist.add(new MonthDetailModel("Кімнатні рослини", "Субтропічним видам (мирт, лавр, олеандр, цитрусові, розмарин, цикас, олива) забезпечте прохолодну зимівлю, наприклад, на теплому балконі (в лоджії) або світлою терасі. При нестачі місця можна провести обрізку, але краще зробити це рано навесні.Тропічним теплолюбним культур (гібіскус китайський, табернемонтана, адениума, бальзамін, свінчатка індійська) організуйте додаткове штучне освітлення.\n" +
                "Інжир поставте в прохолодне (+ 1-10 град.) приміщення. Щоб спланувати терміни цвітіння гиппеаструма, восени не обрізайте зелене листя, скоротіть полив, не доводячи до повного висихання субстрату. Температура змісту - + 13-17 градус. Через 2-2,5 місяця такого спокою можна почати будити цибулини (поставити на світло, відновити полив) з інтервалом в 2 тижні.Азалії для закладки квіткових бруньок потрібна з жовтня по грудень прохолода (+ 6-10 град.).Жовтень - початок опалювального сезону. До звичайного поливу потрібно додати зволоження повітря, догляд за листям і обприскування рослин.",R.drawable.plants));

        RecyclerView myrv = (RecyclerView) findViewById(R.id.rv_main);
        RecyclerviewAdapter myAdapter = new RecyclerviewAdapter(this, mlist);
        myrv.setLayoutManager(new GridLayoutManager(this, 2));
        myrv.setAdapter(myAdapter);
    }
}